mokeMX/dian_git/examples/sensor_hub/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# Ultrasonic #1: software (bit-bang) UART on IO35 (same pin, mode changed HW→SW to free UART1).
CONFIG_SENSOR_HUB_A02YYUW_ENABLE=y
CONFIG_SENSOR_HUB_A02YYUW_USE_SW_UART=y
CONFIG_SENSOR_HUB_A02YYUW_UART=1
CONFIG_SENSOR_HUB_A02YYUW_RX_GPIO=35
CONFIG_SENSOR_HUB_A02YYUW_TX_GPIO=-1
CONFIG_SENSOR_HUB_A02YYUW_BAUDRATE=9600

# Ultrasonic #2: software (bit-bang) UART on IO36 (unchanged).
CONFIG_SENSOR_HUB_A02YYUW2_ENABLE=y
CONFIG_SENSOR_HUB_A02YYUW2_USE_SW_UART=y
CONFIG_SENSOR_HUB_A02YYUW2_UART=2
CONFIG_SENSOR_HUB_A02YYUW2_RX_GPIO=36
CONFIG_SENSOR_HUB_A02YYUW2_TX_GPIO=-1
CONFIG_SENSOR_HUB_A02YYUW2_BAUDRATE=9600

# BU UWB: HW UART1 on GPIO18/37 (与 follow_robot/算法4 引脚一致).
CONFIG_SENSOR_HUB_BU_UWB_ENABLE=y
CONFIG_SENSOR_HUB_BU_UWB_UART=1
CONFIG_SENSOR_HUB_BU_UWB_RX_GPIO=18
CONFIG_SENSOR_HUB_BU_UWB_TX_GPIO=37
CONFIG_SENSOR_HUB_BU_UWB_BAUDRATE=115200

# FSR: ADC1 on GPIO8.
CONFIG_SENSOR_HUB_FSR_ENABLE=y
CONFIG_SENSOR_HUB_FSR_ADC_GPIO=8
CONFIG_SENSOR_HUB_FSR_ADC_CHANNEL=7

# RPLIDAR C1: HW UART2 on GPIO17/9 (与 follow_robot/算法4 引脚一致).
CONFIG_SENSOR_HUB_RPLIDAR_ENABLE=y
CONFIG_SENSOR_HUB_RPLIDAR_UART=2
CONFIG_SENSOR_HUB_RPLIDAR_RX_GPIO=17
CONFIG_SENSOR_HUB_RPLIDAR_TX_GPIO=9
CONFIG_SENSOR_HUB_RPLIDAR_BAUDRATE=460800

# IMU: shared I2C0 on GPIO39/38, addr 0x23 (与 follow_robot/算法4 引脚一致).
CONFIG_SENSOR_HUB_IMU_ENABLE=y
CONFIG_SENSOR_HUB_IMU_ADDR=0x23

# VL53L1X: shared I2C0 on GPIO39/38, addr 0x52.
CONFIG_SENSOR_HUB_VL53L1X_ENABLE=y
CONFIG_SENSOR_HUB_VL53L1X_ADDR_8BIT=0x52
CONFIG_SENSOR_HUB_VL53L1X_TIMING_BUDGET_MS=50
CONFIG_SENSOR_HUB_VL53L1X_INTER_MEASUREMENT_MS=55

# Shared I2C pins (与 follow_robot/算法4 引脚一致).
CONFIG_SENSOR_HUB_I2C_SDA_GPIO=39
CONFIG_SENSOR_HUB_I2C_SCL_GPIO=38
CONFIG_SENSOR_HUB_I2C_SPEED_HZ=400000
